In [121]:
import pandas as pd
from sklearn.model_selection import train_test_split

## Homework

> Note: sometimes your answer doesn't match one of the options exactly.
> That's fine.
> Select the option that's closest to your solution.

In this dataset our desired target for classification task will be `converted` variable - has the client signed up to the platform or not.

In [122]:
# !wget https://raw.githubusercontent.com/alexeygrigorev/datasets/master/course_lead_scoring.csv


### Data preparation

* Check if the missing values are presented in the features.
* If there are missing values:
    * For categorical features, replace them with 'NA'
    * For numerical features, replace with with 0.0

In [123]:
df = pd.read_csv("course_lead_scoring.csv")

In [124]:
df.tail(10)

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
1452,organic_search,retail,1,49154.0,student,africa,4,0.37,1
1453,paid_ads,education,2,65742.0,employed,australia,0,0.57,0
1454,referral,finance,0,75546.0,NaN,asia,0,0.10,0
1455,referral,finance,2,NaN,NaN,south_america,3,0.47,1
1456,social_media,healthcare,1,45253.0,NaN,australia,6,0.24,1
1457,referral,manufacturing,1,NaN,self_employed,north_america,4,0.53,1
1458,referral,technology,3,65259.0,student,europe,2,0.24,1
1459,paid_ads,technology,1,45688.0,student,north_america,3,0.02,1
1460,referral,NaN,5,71016.0,self_employed,north_america,0,0.25,1
1461,organic_search,finance,3,92855.0,student,north_america,3,0.41,1

In [125]:
# Missing values
df.isna().sum()

lead_source                 128
industry                    134
number_of_courses_viewed      0
annual_income               181
employment_status           100
location                     63
interaction_count             0
lead_score                    0
converted                     0
dtype: int64

In [126]:
df.dtypes

lead_source                  object
industry                     object
number_of_courses_viewed      int64
annual_income               float64
employment_status            object
location                     object
interaction_count             int64
lead_score                  float64
converted                     int64
dtype: object

In [127]:
# For numerical features, replace NA with 0.0
df["annual_income"] = df["annual_income"].fillna(0)

In [128]:
# For categorical features, replace missing values (NA) with a string 'NA'
df["lead_source"] = df["lead_source"].fillna("NA")
df["industry"] = df["industry"].fillna("NA")
df["employment_status"] = df["employment_status"].fillna("NA")
df["location"] = df["location"].fillna("NA")

In [129]:
# Missing values
df.isna().sum()

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [130]:
df.head(10).T

,0,1,2,3,4,5,6,7,8,9
lead_source,paid_ads,social_media,events,paid_ads,referral,events,social_media,social_media,referral,paid_ads
industry,NA,retail,healthcare,retail,education,manufacturing,technology,NA,healthcare,other
number_of_courses_viewed,1,1,5,2,3,1,0,5,4,3
annual_income,79450.0,46992.0,78796.0,83843.0,85012.0,59904.0,51283.0,62975.0,38648.0,59866.0
employment_status,unemployed,employed,unemployed,NA,self_employed,NA,NA,student,unemployed,student
location,south_america,south_america,australia,australia,europe,africa,middle_east,europe,south_america,australia
interaction_count,4,1,3,1,3,6,2,4,2,3
lead_score,0.94,0.8,0.69,0.87,0.62,0.83,0.57,0.62,0.86,0.43
converted,1,0,1,0,1,1,0,1,1,1

In [131]:
# The desired target for classification task will be `converted` variable
df["converted"].unique()

array([1, 0])

### Question 1

What is the most frequent observation (mode) for the column `industry`?

- `NA`
- `technology`
- `healthcare`
- `retail`

In [159]:
print(f"The most frequent observation (mode) for the column `industry` is {df['industry'].mode()}")

The most frequent observation (mode) for the column `industry` is 0    retail
Name: industry, dtype: object

### Split the data

* Split your data in train/val/test sets with 60%/20%/20% distribution.
* Use Scikit-Learn for that (the `train_test_split` function) and set the seed to `42`.
* Make sure that the target value `y` is not in your dataframe.

In [160]:
train_test_split?

Signature:
train_test_split(
    *arrays,
    test_size=None,
    train_size=None,
    random_state=None,
    shuffle=True,
    stratify=None,
)
Docstring:
Split arrays or matrices into random train and test subsets.

Quick utility that wraps input validation,
``next(ShuffleSplit().split(X, y))``, and application to input data
into a single call for splitting (and optionally subsampling) data into a
one-liner.

Read more in the :ref:`User Guide <cross_validation>`.

Parameters
----------
*arrays : sequence of indexables with same length / shape[0]
    Allowed inputs are lists, numpy arrays, scipy-sparse
    matrices or pandas dataframes.

test_size : float or int, default=None
    If float, should be between 0.0 and 1.0 and represent the proportion
    of the dataset to include in the test split. If int, represents the
    absolute number of test samples. If None, the value is set to the
    complement of the train size. If ``train_size`` is also None, it will
    be set to 0.25.

train_size : float or int, default=None
    If float, should be between 0.0 and 1.0 and represent the
    proportion of the dataset to include in the train split. If
    int, represents the absolute number of train samples. If None,
    the value is automatically set to the complement of the test size.

random_state : int, RandomState instance or None, default=None
    Controls the shuffling applied to the data before applying the split.
    Pass an int for reproducible output across multiple function calls.
    See :term:`Glossary <random_state>`.

shuffle : bool, default=True
    Whether or not to shuffle the data before splitting. If shuffle=False
    then stratify must be None.

stratify : array-like, default=None
    If not None, data is split in a stratified fashion, using this as
    the class labels.
    Read more in the :ref:`User Guide <stratification>`.

Returns
-------
splitting : list, length=2 * len(arrays)
    List containing train-test split of inputs.

    .. versionadded:: 0.16
        If the input is sparse, the output will be a
        ``scipy.sparse.csr_matrix``. Else, output type is the same as the
        input type.

Examples
--------
>>> import numpy as np
>>> from sklearn.model_selection import train_test_split
>>> X, y = np.arange(10).reshape((5, 2)), range(5)
>>> X
array([[0, 1],
       [2, 3],
       [4, 5],
       [6, 7],
       [8, 9]])
>>> list(y)
[0, 1, 2, 3, 4]

>>> X_train, X_test, y_train, y_test = train_test_split(
...     X, y, test_size=0.33, random_state=42)
...
>>> X_train
array([[4, 5],
       [0, 1],
       [6, 7]])
>>> y_train
[2, 0, 3]
>>> X_test
array([[2, 3],
       [8, 9]])
>>> y_test
[1, 4]

>>> train_test_split(y, shuffle=False)
[[0, 1, 2], [3, 4]]

>>> from sklearn import datasets
>>> iris = datasets.load_iris(as_frame=True)
>>> X, y = iris['data'], iris['target']
>>> X.head()
    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2
>>> y.head()
0    0
1    0
2    0
3    0
4    0
...

>>> X_train, X_test, y_train, y_test = train_test_split(
... X, y, test_size=0.33, random_state=42)
...
>>> X_train.head()
    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
96                 5.7               2.9                4.2               1.3
105                7.6               3.0                6.6               2.1
66                 5.6               3.0                4.5               1.5
0                  5.1               3.5                1.4               0.2
122                7.7               2.8                6.7               2.0
>>> y_train.head()
96     1
105    2
66     1
0      0
122    2
...
>>> X_test.head()
    sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
73                 6.1               2.8                4.7               1.2
18                 5.7               3.8                1.7               0.3
118                7.7               2.6                6.9               2.3
78                 6.0               2.9                4.5               1.5
76                 6.8               2.8                4.8               1.4
>>> y_test.head()
73     1
18     0
118    2
78     1
76     1
...
File:      /workspaces/ml-zoomcamp/.venv/lib/python3.12/site-packages/sklearn/model_selection/_split.py
Type:      function

In [134]:
target_column = "converted"

In [135]:
seed = 42
df_full_train, df_test = train_test_split(df, test_size=0.2, random_state=seed)

In [136]:
print(len(df), len(df_full_train), len(df_test))

1462 1169 293

In [137]:
df_train, df_validation = train_test_split(df_full_train, test_size=0.25, random_state=seed)

In [138]:
print(len(df), len(df_full_train), len(df_train), len(df_validation), len(df_test))

1462 1169 876 293 293

In [139]:
def split_features_and_target(df_train, df_validation, df_test):
    df_train = df_train.copy()
    df_validation = df_validation.copy()
    df_test = df_test.copy()

    y_train = df_train[target_column].values
    y_validation = df_validation[target_column].values
    y_test = df_test[target_column].values

    df_train = df_train.drop([target_column], axis=1)
    df_validation = df_validation.drop([target_column], axis=1)
    df_test = df_test.drop([target_column], axis=1)

    return df_train, y_train, df_validation, y_validation, df_test, y_test

In [140]:
df_train, y_train, df_validation, y_validation, df_test, y_test = split_features_and_target(df_train, df_validation, df_test)

### EDA

In [141]:
# Verify that the target column does not exist in the dataframe
df_train.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score
1077,paid_ads,retail,0,58472.0,student,middle_east,5,0.03
463,organic_search,manufacturing,3,71738.0,student,middle_east,6,0.77
842,paid_ads,technology,3,81973.0,employed,north_america,2,0.59
835,NA,technology,1,74956.0,employed,europe,3,0.34
837,organic_search,retail,3,59335.0,student,australia,1,0.98

In [143]:
df_full_train.isnull().sum()

lead_source                 0
industry                    0
number_of_courses_viewed    0
annual_income               0
employment_status           0
location                    0
interaction_count           0
lead_score                  0
converted                   0
dtype: int64

In [151]:
df_full_train.head()

,lead_source,industry,number_of_courses_viewed,annual_income,employment_status,location,interaction_count,lead_score,converted
1066,social_media,manufacturing,2,44403.0,self_employed,australia,1,0.71,0
638,events,retail,3,38048.0,student,north_america,6,0.97,1
799,social_media,education,2,71399.0,NA,europe,1,0.51,1
380,referral,education,2,47912.0,employed,australia,1,0.04,0
303,paid_ads,healthcare,1,34806.0,employed,europe,4,0.32,1

In [144]:
df_full_train[target_column].value_counts()

converted
1    710
0    459
Name: count, dtype: int64

In [148]:
# Let's get a converted rate
df_full_train[target_column].value_counts(normalize=True)

converted
1    0.607357
0    0.392643
Name: proportion, dtype: float64

In [150]:
global_converted_rate = df_full_train[target_column].mean()
global_converted_rate

np.float64(0.6073567151411463)

### Feature importance. Rate and Risk Ratio.

In [155]:
# Get a converted rate for the `education` industry
education_industry_converted_rate = df_full_train[df_full_train["industry"] == "education"][target_column].mean()
education_industry_converted_rate

np.float64(0.7902097902097902)

In [161]:
# The difference of the converted rate for the `education` industry and a global converted rate is not small.
# It gives us intuition that the `global converted rate` is better if users come from the education industry.
education_industry_converted_rate - global_converted_rate

np.float64(0.1828530750686439)

In [162]:
# Let's calculate the converted rate for each value of the `industry` column
df_full_train.groupby("industry")[target_column].mean()

industry
NA               0.557522
education        0.790210
finance          0.556886
healthcare       0.593333
manufacturing    0.621429
other            0.612903
retail           0.566265
technology       0.562963
Name: converted, dtype: float64

In [166]:
df_full_train.groupby("industry")[target_column].agg(["mean", "count"])

                   mean  count
industry
NA             0.557522    113
education      0.790210    143
finance        0.556886    167
healthcare     0.593333    150
manufacturing  0.621429    140
other          0.612903    155
retail         0.566265    166
technology     0.562963    135

In [163]:
# The difference between converted rates are:
df_full_train.groupby("industry")[target_column].mean() - global_converted_rate

industry
NA              -0.049835
education        0.182853
finance         -0.050470
healthcare      -0.014023
manufacturing    0.014072
other            0.005547
retail          -0.041092
technology      -0.044394
Name: converted, dtype: float64

The conclusion is that users from the `education` industry have the best conversion.

Let's take a look at all categorical values and calculate `rate` and `ratio`

In [ ]:
from IPython.display import display

for column in ["lead_source", "industry", "employment_status", "location"]:
    display(column)

    df_group = df_full_train.groupby(column)[target_column].agg(["mean", "count"])
    df_group["diff"] = df_group["mean"] - global_converted_rate
    df_group["rate"] = df_group["mean"] / global_converted_rate

    display(df_group)

'lead_source'

                    mean  count      diff      rate
lead_source
NA              0.669725    109  0.062368  1.102688
events          0.592965    199 -0.014392  0.976304
organic_search  0.615721    229  0.008364  1.013771
paid_ads        0.428571    210 -0.178785  0.705634
referral        0.786408    206  0.179051  1.294804
social_media    0.583333    216 -0.024023  0.960446

'industry'

                   mean  count      diff      rate
industry
NA             0.557522    113 -0.049835  0.917948
education      0.790210    143  0.182853  1.301064
finance        0.556886    167 -0.050470  0.916901
healthcare     0.593333    150 -0.014023  0.976911
manufacturing  0.621429    140  0.014072  1.023169
other          0.612903    155  0.005547  1.009132
retail         0.566265    166 -0.041092  0.932343
technology     0.562963    135 -0.044394  0.926907

'employment_status'

                       mean  count      diff      rate
employment_status
NA                 0.571429     84 -0.035928  0.940845
employed           0.671937    253  0.064580  1.106330
self_employed      0.635739    291  0.028382  1.046731
student            0.659722    288  0.052366  1.086219
unemployed         0.462451    253 -0.144906  0.761415

'location'

                   mean  count      diff      rate
location
NA             0.680000     50  0.072643  1.119606
africa         0.592857    140 -0.014500  0.976127
asia           0.588608    158 -0.018749  0.969130
australia      0.612903    155  0.005547  1.009132
europe         0.641176    170  0.033820  1.055684
middle_east    0.644172    163  0.036815  1.060615
north_america  0.589888    178 -0.017469  0.971238
south_america  0.554839    155 -0.052518  0.913530

### Feature importance. Mutual information.
Mutual information - concept from information theory, it tells us how much we can learn about one variable if we know the value of another

### Question 2

Create the [correlation matrix](https://www.google.com/search?q=correlation+matrix) for the numerical features of your dataset. 
In a correlation matrix, you compute the correlation coefficient between every pair of features.

What are the two features that have the biggest correlation?

- `interaction_count` and `lead_score`
- `number_of_courses_viewed` and `lead_score`
- `number_of_courses_viewed` and `interaction_count`
- `annual_income` and `interaction_count`

Only consider the pairs above when answering this question.